**Terraform Cmd:** `plan default terraform/aws-test`

**Terraform Plan:**
```diff
[command]/home/runner/work/_temp/33d088bf-5d07-4e01-bf14-896fe4f4ea03/terraform-bin show -no-color /tmp/plan-718a7283-8041-444e-b034-55c483cf45e0

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_string.random will be created
+   resource "random_string" "random" {
+       id               = (known after apply)
+       length           = 16
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       numeric          = true
+       override_special = "/@£$"
+       result           = (known after apply)
+       special          = true
+       upper            = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   string_out = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # random_string.random will be created%0A  + resource "random_string" "random" {%0A      + id               = (known after apply)%0A      + length           = 16%0A      + lower            = true%0A      + min_lower        = 0%0A      + min_numeric      = 0%0A      + min_special      = 0%0A      + min_upper        = 0%0A      + number           = true%0A      + numeric          = true%0A      + override_special = "/@£$"%0A      + result           = (known after apply)%0A      + special          = true%0A      + upper            = true%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + string_out = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0
```

**Link:** https://github.com/faisal-auto1/github-kitchen-terraform-action/actions/runs/8148194761/job/22270535538#step:6:1

**Plan ID:** `718a7283-8041-444e-b034-55c483cf45e0`

**How to apply :**

  Please comment again with this command to apply the plan: ```apply default terraform/aws-test 718a7283-8041-444e-b034-55c483cf45e0```